Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_gv_vl_cnano/pic32cm_gv_vl_cnano_getting_started/firmware/src/packs/PIC32CM3204GV00064_DFP/component/sysctrl.h
/*
 * Component description for SYSCTRL
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2019-11-25T23:26:27Z  */
#ifndef _PIC32CMGV00_SYSCTRL_COMPONENT_H_
#define _PIC32CMGV00_SYSCTRL_COMPONENT_H_

/* ************************************************************************** */
/*                    SOFTWARE API DEFINITION FOR SYSCTRL                     */
/* ************************************************************************** */

/* -------- SYSCTRL_INTENCLR : (SYSCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define SYSCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (SYSCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SYSCTRL_INTENCLR_XOSCRDY_Pos          _UINT32_(0)                                          /* (SYSCTRL_INTENCLR) XOSC Ready Position */
#define SYSCTRL_INTENCLR_XOSCRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENCLR_XOSCRDY_Pos)      /* (SYSCTRL_INTENCLR) XOSC Ready Mask */
#define SYSCTRL_INTENCLR_XOSCRDY(value)       (SYSCTRL_INTENCLR_XOSCRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_XOSCRDY_Pos)) /* Assignment of value for XOSCRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_XOSC32KRDY_Pos       _UINT32_(1)                                          /* (SYSCTRL_INTENCLR) XOSC32K Ready Position */
#define SYSCTRL_INTENCLR_XOSC32KRDY_Msk       (_UINT32_(0x1) << SYSCTRL_INTENCLR_XOSC32KRDY_Pos)   /* (SYSCTRL_INTENCLR) XOSC32K Ready Mask */
#define SYSCTRL_INTENCLR_XOSC32KRDY(value)    (SYSCTRL_INTENCLR_XOSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_XOSC32KRDY_Pos)) /* Assignment of value for XOSC32KRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_OSC32KRDY_Pos        _UINT32_(2)                                          /* (SYSCTRL_INTENCLR) OSC32K Ready Position */
#define SYSCTRL_INTENCLR_OSC32KRDY_Msk        (_UINT32_(0x1) << SYSCTRL_INTENCLR_OSC32KRDY_Pos)    /* (SYSCTRL_INTENCLR) OSC32K Ready Mask */
#define SYSCTRL_INTENCLR_OSC32KRDY(value)     (SYSCTRL_INTENCLR_OSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_OSC32KRDY_Pos)) /* Assignment of value for OSC32KRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_OSC8MRDY_Pos         _UINT32_(3)                                          /* (SYSCTRL_INTENCLR) OSC8M Ready Position */
#define SYSCTRL_INTENCLR_OSC8MRDY_Msk         (_UINT32_(0x1) << SYSCTRL_INTENCLR_OSC8MRDY_Pos)     /* (SYSCTRL_INTENCLR) OSC8M Ready Mask */
#define SYSCTRL_INTENCLR_OSC8MRDY(value)      (SYSCTRL_INTENCLR_OSC8MRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_OSC8MRDY_Pos)) /* Assignment of value for OSC8MRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLRDY_Pos          _UINT32_(4)                                          /* (SYSCTRL_INTENCLR) DFLL Ready Position */
#define SYSCTRL_INTENCLR_DFLLRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLRDY_Pos)      /* (SYSCTRL_INTENCLR) DFLL Ready Mask */
#define SYSCTRL_INTENCLR_DFLLRDY(value)       (SYSCTRL_INTENCLR_DFLLRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_DFLLRDY_Pos)) /* Assignment of value for DFLLRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLOOB_Pos          _UINT32_(5)                                          /* (SYSCTRL_INTENCLR) DFLL Out Of Bounds Position */
#define SYSCTRL_INTENCLR_DFLLOOB_Msk          (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLOOB_Pos)      /* (SYSCTRL_INTENCLR) DFLL Out Of Bounds Mask */
#define SYSCTRL_INTENCLR_DFLLOOB(value)       (SYSCTRL_INTENCLR_DFLLOOB_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_DFLLOOB_Pos)) /* Assignment of value for DFLLOOB in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLLCKF_Pos         _UINT32_(6)                                          /* (SYSCTRL_INTENCLR) DFLL Lock Fine Position */
#define SYSCTRL_INTENCLR_DFLLLCKF_Msk         (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLLCKF_Pos)     /* (SYSCTRL_INTENCLR) DFLL Lock Fine Mask */
#define SYSCTRL_INTENCLR_DFLLLCKF(value)      (SYSCTRL_INTENCLR_DFLLLCKF_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_DFLLLCKF_Pos)) /* Assignment of value for DFLLLCKF in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLLCKC_Pos         _UINT32_(7)                                          /* (SYSCTRL_INTENCLR) DFLL Lock Coarse Position */
#define SYSCTRL_INTENCLR_DFLLLCKC_Msk         (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLLCKC_Pos)     /* (SYSCTRL_INTENCLR) DFLL Lock Coarse Mask */
#define SYSCTRL_INTENCLR_DFLLLCKC(value)      (SYSCTRL_INTENCLR_DFLLLCKC_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_DFLLLCKC_Pos)) /* Assignment of value for DFLLLCKC in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLRCS_Pos          _UINT32_(8)                                          /* (SYSCTRL_INTENCLR) DFLL Reference Clock Stopped Position */
#define SYSCTRL_INTENCLR_DFLLRCS_Msk          (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLRCS_Pos)      /* (SYSCTRL_INTENCLR) DFLL Reference Clock Stopped Mask */
#define SYSCTRL_INTENCLR_DFLLRCS(value)       (SYSCTRL_INTENCLR_DFLLRCS_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_DFLLRCS_Pos)) /* Assignment of value for DFLLRCS in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_BOD33RDY_Pos         _UINT32_(9)                                          /* (SYSCTRL_INTENCLR) BOD33 Ready Position */
#define SYSCTRL_INTENCLR_BOD33RDY_Msk         (_UINT32_(0x1) << SYSCTRL_INTENCLR_BOD33RDY_Pos)     /* (SYSCTRL_INTENCLR) BOD33 Ready Mask */
#define SYSCTRL_INTENCLR_BOD33RDY(value)      (SYSCTRL_INTENCLR_BOD33RDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_BOD33RDY_Pos)) /* Assignment of value for BOD33RDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_BOD33DET_Pos         _UINT32_(10)                                         /* (SYSCTRL_INTENCLR) BOD33 Detection Position */
#define SYSCTRL_INTENCLR_BOD33DET_Msk         (_UINT32_(0x1) << SYSCTRL_INTENCLR_BOD33DET_Pos)     /* (SYSCTRL_INTENCLR) BOD33 Detection Mask */
#define SYSCTRL_INTENCLR_BOD33DET(value)      (SYSCTRL_INTENCLR_BOD33DET_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_BOD33DET_Pos)) /* Assignment of value for BOD33DET in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_B33SRDY_Pos          _UINT32_(11)                                         /* (SYSCTRL_INTENCLR) BOD33 Synchronization Ready Position */
#define SYSCTRL_INTENCLR_B33SRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENCLR_B33SRDY_Pos)      /* (SYSCTRL_INTENCLR) BOD33 Synchronization Ready Mask */
#define SYSCTRL_INTENCLR_B33SRDY(value)       (SYSCTRL_INTENCLR_B33SRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENCLR_B33SRDY_Pos)) /* Assignment of value for B33SRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_Msk                  _UINT32_(0x00000FFF)                                 /* (SYSCTRL_INTENCLR) Register Mask  */


/* -------- SYSCTRL_INTENSET : (SYSCTRL Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SYSCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (SYSCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define SYSCTRL_INTENSET_XOSCRDY_Pos          _UINT32_(0)                                          /* (SYSCTRL_INTENSET) XOSC Ready Position */
#define SYSCTRL_INTENSET_XOSCRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENSET_XOSCRDY_Pos)      /* (SYSCTRL_INTENSET) XOSC Ready Mask */
#define SYSCTRL_INTENSET_XOSCRDY(value)       (SYSCTRL_INTENSET_XOSCRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_XOSCRDY_Pos)) /* Assignment of value for XOSCRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_XOSC32KRDY_Pos       _UINT32_(1)                                          /* (SYSCTRL_INTENSET) XOSC32K Ready Position */
#define SYSCTRL_INTENSET_XOSC32KRDY_Msk       (_UINT32_(0x1) << SYSCTRL_INTENSET_XOSC32KRDY_Pos)   /* (SYSCTRL_INTENSET) XOSC32K Ready Mask */
#define SYSCTRL_INTENSET_XOSC32KRDY(value)    (SYSCTRL_INTENSET_XOSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_XOSC32KRDY_Pos)) /* Assignment of value for XOSC32KRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_OSC32KRDY_Pos        _UINT32_(2)                                          /* (SYSCTRL_INTENSET) OSC32K Ready Position */
#define SYSCTRL_INTENSET_OSC32KRDY_Msk        (_UINT32_(0x1) << SYSCTRL_INTENSET_OSC32KRDY_Pos)    /* (SYSCTRL_INTENSET) OSC32K Ready Mask */
#define SYSCTRL_INTENSET_OSC32KRDY(value)     (SYSCTRL_INTENSET_OSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_OSC32KRDY_Pos)) /* Assignment of value for OSC32KRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_OSC8MRDY_Pos         _UINT32_(3)                                          /* (SYSCTRL_INTENSET) OSC8M Ready Position */
#define SYSCTRL_INTENSET_OSC8MRDY_Msk         (_UINT32_(0x1) << SYSCTRL_INTENSET_OSC8MRDY_Pos)     /* (SYSCTRL_INTENSET) OSC8M Ready Mask */
#define SYSCTRL_INTENSET_OSC8MRDY(value)      (SYSCTRL_INTENSET_OSC8MRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_OSC8MRDY_Pos)) /* Assignment of value for OSC8MRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLRDY_Pos          _UINT32_(4)                                          /* (SYSCTRL_INTENSET) DFLL Ready Position */
#define SYSCTRL_INTENSET_DFLLRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLRDY_Pos)      /* (SYSCTRL_INTENSET) DFLL Ready Mask */
#define SYSCTRL_INTENSET_DFLLRDY(value)       (SYSCTRL_INTENSET_DFLLRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_DFLLRDY_Pos)) /* Assignment of value for DFLLRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLOOB_Pos          _UINT32_(5)                                          /* (SYSCTRL_INTENSET) DFLL Out Of Bounds Position */
#define SYSCTRL_INTENSET_DFLLOOB_Msk          (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLOOB_Pos)      /* (SYSCTRL_INTENSET) DFLL Out Of Bounds Mask */
#define SYSCTRL_INTENSET_DFLLOOB(value)       (SYSCTRL_INTENSET_DFLLOOB_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_DFLLOOB_Pos)) /* Assignment of value for DFLLOOB in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLLCKF_Pos         _UINT32_(6)                                          /* (SYSCTRL_INTENSET) DFLL Lock Fine Position */
#define SYSCTRL_INTENSET_DFLLLCKF_Msk         (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLLCKF_Pos)     /* (SYSCTRL_INTENSET) DFLL Lock Fine Mask */
#define SYSCTRL_INTENSET_DFLLLCKF(value)      (SYSCTRL_INTENSET_DFLLLCKF_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_DFLLLCKF_Pos)) /* Assignment of value for DFLLLCKF in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLLCKC_Pos         _UINT32_(7)                                          /* (SYSCTRL_INTENSET) DFLL Lock Coarse Position */
#define SYSCTRL_INTENSET_DFLLLCKC_Msk         (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLLCKC_Pos)     /* (SYSCTRL_INTENSET) DFLL Lock Coarse Mask */
#define SYSCTRL_INTENSET_DFLLLCKC(value)      (SYSCTRL_INTENSET_DFLLLCKC_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_DFLLLCKC_Pos)) /* Assignment of value for DFLLLCKC in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLRCS_Pos          _UINT32_(8)                                          /* (SYSCTRL_INTENSET) DFLL Reference Clock Stopped Position */
#define SYSCTRL_INTENSET_DFLLRCS_Msk          (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLRCS_Pos)      /* (SYSCTRL_INTENSET) DFLL Reference Clock Stopped Mask */
#define SYSCTRL_INTENSET_DFLLRCS(value)       (SYSCTRL_INTENSET_DFLLRCS_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_DFLLRCS_Pos)) /* Assignment of value for DFLLRCS in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_BOD33RDY_Pos         _UINT32_(9)                                          /* (SYSCTRL_INTENSET) BOD33 Ready Position */
#define SYSCTRL_INTENSET_BOD33RDY_Msk         (_UINT32_(0x1) << SYSCTRL_INTENSET_BOD33RDY_Pos)     /* (SYSCTRL_INTENSET) BOD33 Ready Mask */
#define SYSCTRL_INTENSET_BOD33RDY(value)      (SYSCTRL_INTENSET_BOD33RDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_BOD33RDY_Pos)) /* Assignment of value for BOD33RDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_BOD33DET_Pos         _UINT32_(10)                                         /* (SYSCTRL_INTENSET) BOD33 Detection Position */
#define SYSCTRL_INTENSET_BOD33DET_Msk         (_UINT32_(0x1) << SYSCTRL_INTENSET_BOD33DET_Pos)     /* (SYSCTRL_INTENSET) BOD33 Detection Mask */
#define SYSCTRL_INTENSET_BOD33DET(value)      (SYSCTRL_INTENSET_BOD33DET_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_BOD33DET_Pos)) /* Assignment of value for BOD33DET in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_B33SRDY_Pos          _UINT32_(11)                                         /* (SYSCTRL_INTENSET) BOD33 Synchronization Ready Position */
#define SYSCTRL_INTENSET_B33SRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTENSET_B33SRDY_Pos)      /* (SYSCTRL_INTENSET) BOD33 Synchronization Ready Mask */
#define SYSCTRL_INTENSET_B33SRDY(value)       (SYSCTRL_INTENSET_B33SRDY_Msk & (_UINT32_(value) << SYSCTRL_INTENSET_B33SRDY_Pos)) /* Assignment of value for B33SRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_Msk                  _UINT32_(0x00000FFF)                                 /* (SYSCTRL_INTENSET) Register Mask  */


/* -------- SYSCTRL_INTFLAG : (SYSCTRL Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SYSCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (SYSCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SYSCTRL_INTFLAG_XOSCRDY_Pos           _UINT32_(0)                                          /* (SYSCTRL_INTFLAG) XOSC Ready Position */
#define SYSCTRL_INTFLAG_XOSCRDY_Msk           (_UINT32_(0x1) << SYSCTRL_INTFLAG_XOSCRDY_Pos)       /* (SYSCTRL_INTFLAG) XOSC Ready Mask */
#define SYSCTRL_INTFLAG_XOSCRDY(value)        (SYSCTRL_INTFLAG_XOSCRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_XOSCRDY_Pos)) /* Assignment of value for XOSCRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_XOSC32KRDY_Pos        _UINT32_(1)                                          /* (SYSCTRL_INTFLAG) XOSC32K Ready Position */
#define SYSCTRL_INTFLAG_XOSC32KRDY_Msk        (_UINT32_(0x1) << SYSCTRL_INTFLAG_XOSC32KRDY_Pos)    /* (SYSCTRL_INTFLAG) XOSC32K Ready Mask */
#define SYSCTRL_INTFLAG_XOSC32KRDY(value)     (SYSCTRL_INTFLAG_XOSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_XOSC32KRDY_Pos)) /* Assignment of value for XOSC32KRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_OSC32KRDY_Pos         _UINT32_(2)                                          /* (SYSCTRL_INTFLAG) OSC32K Ready Position */
#define SYSCTRL_INTFLAG_OSC32KRDY_Msk         (_UINT32_(0x1) << SYSCTRL_INTFLAG_OSC32KRDY_Pos)     /* (SYSCTRL_INTFLAG) OSC32K Ready Mask */
#define SYSCTRL_INTFLAG_OSC32KRDY(value)      (SYSCTRL_INTFLAG_OSC32KRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_OSC32KRDY_Pos)) /* Assignment of value for OSC32KRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_OSC8MRDY_Pos          _UINT32_(3)                                          /* (SYSCTRL_INTFLAG) OSC8M Ready Position */
#define SYSCTRL_INTFLAG_OSC8MRDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTFLAG_OSC8MRDY_Pos)      /* (SYSCTRL_INTFLAG) OSC8M Ready Mask */
#define SYSCTRL_INTFLAG_OSC8MRDY(value)       (SYSCTRL_INTFLAG_OSC8MRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_OSC8MRDY_Pos)) /* Assignment of value for OSC8MRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLRDY_Pos           _UINT32_(4)                                          /* (SYSCTRL_INTFLAG) DFLL Ready Position */
#define SYSCTRL_INTFLAG_DFLLRDY_Msk           (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLRDY_Pos)       /* (SYSCTRL_INTFLAG) DFLL Ready Mask */
#define SYSCTRL_INTFLAG_DFLLRDY(value)        (SYSCTRL_INTFLAG_DFLLRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_DFLLRDY_Pos)) /* Assignment of value for DFLLRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLOOB_Pos           _UINT32_(5)                                          /* (SYSCTRL_INTFLAG) DFLL Out Of Bounds Position */
#define SYSCTRL_INTFLAG_DFLLOOB_Msk           (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLOOB_Pos)       /* (SYSCTRL_INTFLAG) DFLL Out Of Bounds Mask */
#define SYSCTRL_INTFLAG_DFLLOOB(value)        (SYSCTRL_INTFLAG_DFLLOOB_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_DFLLOOB_Pos)) /* Assignment of value for DFLLOOB in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLLCKF_Pos          _UINT32_(6)                                          /* (SYSCTRL_INTFLAG) DFLL Lock Fine Position */
#define SYSCTRL_INTFLAG_DFLLLCKF_Msk          (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLLCKF_Pos)      /* (SYSCTRL_INTFLAG) DFLL Lock Fine Mask */
#define SYSCTRL_INTFLAG_DFLLLCKF(value)       (SYSCTRL_INTFLAG_DFLLLCKF_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_DFLLLCKF_Pos)) /* Assignment of value for DFLLLCKF in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLLCKC_Pos          _UINT32_(7)                                          /* (SYSCTRL_INTFLAG) DFLL Lock Coarse Position */
#define SYSCTRL_INTFLAG_DFLLLCKC_Msk          (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLLCKC_Pos)      /* (SYSCTRL_INTFLAG) DFLL Lock Coarse Mask */
#define SYSCTRL_INTFLAG_DFLLLCKC(value)       (SYSCTRL_INTFLAG_DFLLLCKC_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_DFLLLCKC_Pos)) /* Assignment of value for DFLLLCKC in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLRCS_Pos           _UINT32_(8)                                          /* (SYSCTRL_INTFLAG) DFLL Reference Clock Stopped Position */
#define SYSCTRL_INTFLAG_DFLLRCS_Msk           (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLRCS_Pos)       /* (SYSCTRL_INTFLAG) DFLL Reference Clock Stopped Mask */
#define SYSCTRL_INTFLAG_DFLLRCS(value)        (SYSCTRL_INTFLAG_DFLLRCS_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_DFLLRCS_Pos)) /* Assignment of value for DFLLRCS in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_BOD33RDY_Pos          _UINT32_(9)                                          /* (SYSCTRL_INTFLAG) BOD33 Ready Position */
#define SYSCTRL_INTFLAG_BOD33RDY_Msk          (_UINT32_(0x1) << SYSCTRL_INTFLAG_BOD33RDY_Pos)      /* (SYSCTRL_INTFLAG) BOD33 Ready Mask */
#define SYSCTRL_INTFLAG_BOD33RDY(value)       (SYSCTRL_INTFLAG_BOD33RDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_BOD33RDY_Pos)) /* Assignment of value for BOD33RDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_BOD33DET_Pos          _UINT32_(10)                                         /* (SYSCTRL_INTFLAG) BOD33 Detection Position */
#define SYSCTRL_INTFLAG_BOD33DET_Msk          (_UINT32_(0x1) << SYSCTRL_INTFLAG_BOD33DET_Pos)      /* (SYSCTRL_INTFLAG) BOD33 Detection Mask */
#define SYSCTRL_INTFLAG_BOD33DET(value)       (SYSCTRL_INTFLAG_BOD33DET_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_BOD33DET_Pos)) /* Assignment of value for BOD33DET in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_B33SRDY_Pos           _UINT32_(11)                                         /* (SYSCTRL_INTFLAG) BOD33 Synchronization Ready Position */
#define SYSCTRL_INTFLAG_B33SRDY_Msk           (_UINT32_(0x1) << SYSCTRL_INTFLAG_B33SRDY_Pos)       /* (SYSCTRL_INTFLAG) BOD33 Synchronization Ready Mask */
#define SYSCTRL_INTFLAG_B33SRDY(value)        (SYSCTRL_INTFLAG_B33SRDY_Msk & (_UINT32_(value) << SYSCTRL_INTFLAG_B33SRDY_Pos)) /* Assignment of value for B33SRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_Msk                   _UINT32_(0x00000FFF)                                 /* (SYSCTRL_INTFLAG) Register Mask  */


/* -------- SYSCTRL_PCLKSR : (SYSCTRL Offset: 0x0C) ( R/ 32) Power and Clocks Status -------- */
#define SYSCTRL_PCLKSR_RESETVALUE             _UINT32_(0x00)                                       /*  (SYSCTRL_PCLKSR) Power and Clocks Status  Reset Value */

